Repository: pohldaniel/jazz2
Catalog: Jazz2Data/Content/Translations/*.po
Languages: cs

# flash/01_diam1
source: Spaz ate the dopefish.
cs: Spaz sežral dopefish.

# flash/01_diam1
source: Find the gopher.
cs: Najděte sysla.

# flash/01_diam1
source: Dragons live in burbank.
cs: Draci žijí v Burbanku.

# flash/01_diam1
source: Mark wears briefs. Hoo Hah!
cs: Mark nosí slipy. Hoo Hah!

# flash/01_diam1
source: Nick loves shiny. Always has!
cs: Nick miluje lesklé. Vždycky to tak bylo!

# flash/02_diam3
source: Send Tim new socks.
cs: Pošlete Timovi nové ponožky.

# flash/02_diam3
source: Send Nigel a green card.
cs: Pošlete Nigelovi zelenou kartu.

# flash/02_diam3
source: Beware of chainsaw schmalz.
cs: Pozor na řetězovou pilu Schmalz.

# flash/02_diam3
source: Dont give mark a burrito.
cs: Nedávejte Markovi burrito.

# flash/05_medivo1
source: Beware of falling enemies.
cs: Pozor na padající nepřátele.

# flash/05_medivo1
source: Craig is still a doofus!
cs: Craig je stále hlupák!

# flash/05_medivo1
source: Secret Level Time!!!
cs: Čas na tajnou úroveň!!!

# flash/bonus_garglair
source: Buttstomp A Silver Crate To Clear Your Path
cs: Rozšlápněte stříbrnou bednu a uvolněte si cestu

# flash/bonus_garglair
source: Crates can also make platforms appear...
cs: Díky bednám se také mohou objevit plošiny...

# flash/bonus_garglair
source: Melt the Spring...
cs: Roztavte pružinu...

# flash/bonus_garglair
source: Leh is a Camper
cs: Leh je táborník

# monk/01_jung1
source: Falling boulders can give you a headache.
cs: Padající balvany mohou způsobit bolest hlavy.

# monk/01_jung1
source: A Flamethrower works well against bugs.
cs: Proti broukům dobře funguje plamenomet.

# monk/03_hell
source: Long live the ice level.
cs: Ať žije ledová úroveň.

# monk/03_hell
source: Goodnight, bubba!
cs: Dobrou noc, Bubbo!

# monk/06_damn2
source: What the heck? Aaaah! No! This is NOT over!
cs: Co to sakra je? Aaaah! Ne! Tohle NENÍ konec!

# prince/01_castle1
source: Poles spin you around so you can go even faster.
cs: Tyče vás roztočí tak, že poběžíte ještě rychleji.

# prince/01_castle1
source: You found a secret area.
cs: Našli jste tajnou oblast.

# prince/01_castle1
source: Secret Treasure Room.
cs: Tajná místnost s pokladem.

# prince/01_castle1
source: Nothing to see here.
cs: Tady není nic k vidění.

# prince/01_castle1
source: Collect coins to activate bonus warp devices.
cs: Sbírejte mince a aktivujte bonusová teleportační zařízení.

# prince/02_castle1n
source: Cheese is green on tuesday.
cs: V úterý je sýr zelený.

# prince/02_castle1n
source: Craig is king doofus.
cs: Craig je král pitomec.

# prince/02_castle1n
source: To beat the queen shoot her off her ledge.
cs: Chcete-li porazit královnu, sestřelte ji z římsy.

# prince/02_castle1n
source: Good job! Now go get Devan Shell!
cs: Dobrá práce! Teď rychle pro Devanův krunýř!

# prince/02_castle1n
source: To kick through these blocks, press down and jump!
cs: Pro proražení těchto bloků stiskněte tlačítko dolů a skok!

# prince/02_castle1n
source: Press down and jump beneath these blocks to break them!
cs: Stisknete-li tlačítko dolů a skočíte pod těmito bloky, dojde k rozbití!

# prince/02_castle1n
source: Buttstomp the metal box to open key blocks!
cs: Rozšlápněte kovovou krabici pro otevření zamčených bloků!

# prince/03_carrot1
source: Stomp your booty to exit.
cs: Pro odchod si dupněte na zadek.

# prince/03_carrot1
source: This spring is frozen.
cs: Tato pružina je zamrzlá.

# prince/04_carrot1n
source: Super dooper secret.
cs: Super tajná místnost.

# prince/04_carrot1n
source: Shields will give you unlimited special ammo for a short time.
cs: Štíty vám na krátkou dobu poskytnou neomezenou speciální munici.

# prince/04_carrot1n
source: Stopwatches will add time to the life of a shield.
cs: Stopky přidají trochu času navíc do štítu.

# prince/04_carrot1n
source: This schwartzenguard is toast!
cs: Tenhle Schwartzenguard je v háji!

# prince/06_labrat2
source: You cannot defeat me, Jazz! Prepare to face my superbot!
cs: Nemůžeš mě porazit, Jazzi! Připrav se na mého superbota!

# prince/06_labrat2
source: Ack! I'm outta here!
cs: Sakra! Mizím odsud!

# prince/06_labrat2
source: These blocks are speed blocks. Run into them at full speed!
cs: Tyto bloky jsou rychlostní bloky. Rozběhněte se do nich plnou rychlostí!

# prince/trainer
source: Welcome to Jazz Jackrabbit 2. This is a training level.
cs: Vítejte ve hře Jazz Jackrabbit 2. Toto je tréninková úroveň.

# prince/trainer
source: Collect goodies for points and surprises.
cs: Sbírejte dobroty pro body a překvapení.

# prince/trainer
source: After jumping, press jump again to do a special move.
cs: Po skoku znovu stiskněte skok pro provedení speciálního pohybu.

# prince/trainer
source: Some walls can be shot.
cs: Některé stěny lze rozstřílet.

# prince/trainer
source: When in the air, press down to stomp with your butt.
cs: Když jste ve vzduchu, stiskněte tlačítko dolů pro proražení bloků směrem dolu.

# prince/trainer
source: Secrets abound in Jazz 2. Check the walls.
cs: Ve hře je mnoho tajemství. Zkontrolujte stěny.

# prince/trainer
source: Good job. Remember to look for secrets.
cs: Dobrá práce. Nezapomeňte hledat tajemství.

# prince/trainer
source: Collect gems for an extra life.
cs: Sbírejte drahokamy pro životy navíc.

# prince/trainer
source: Red Gems count as one gem.
cs: Červený drahokam se počítá jako jeden.

# prince/trainer
source: Green gems count as five gems.
cs: Zelený drahokam se počítá jako pět.

# prince/trainer
source: Blue gems count as ten gems.
cs: Modrý drahokam se počítá jako deset.

# prince/trainer
source: Carrots give you health.
cs: Mrkev vám dodá zdraví.

# prince/trainer
source: Checkpoints save your spot if you lose a life.
cs: Kontrolní body vám uloží pozici, pokud ztratíte život.

# prince/trainer
source: Collect coins to unlock bonus rooms.
cs: Sbíráním mincí odemknete bonusové místnosti.

# prince/trainer
source: Beware of sharp stuff. It hurts.
cs: Pozor na ostré věci. Bolí to.

# prince/trainer
source: Now youre ready to play. Good luck and have fun.
cs: Nyní jste připraveni hrát. Hodně štěstí a zábavy.

# rescue/01_colon1
source: Buttstomp the manhole cover!
cs: Prorazte poklop kanálu!

# rescue/03_psych1
source: Smoke rings will make you dizzy.
cs: Z kouřových mraků se vám bude točit hlava.

# secretf/01_easter1
source: You can't buttstomp so go up and around!
cs: Tohle nejde prorazit, je to potřeba obejít!

# secretf/01_easter1
source: No rewards to those with itchy trigger fingers.
cs: Žádné odměny pro ty, které svědí prsty na spoušti.

# secretf/01_easter1
source: Todays Forcast: Strong Winds!
cs: Dnešní předpověď: Silný vítr!

# secretf/01_easter1
source: Find the crate to clear your path.
cs: Najděte bednu pro uvolnění cesty.

# secretf/01_easter1
source: Welcome to Jazz Jackrabbit 2: The Secret Files!
cs: Vítejte v Jazz Jackrabbit 2: The Secret Files!

# secretf/01_easter1
source: Only Spaz can get to the room up on the left. He may need something to stand on.
cs: Pouze Spaz se může dostat do místnosti vlevo nahoře. Možná bude potřebovat něco, na čem by mohl stát.

# secretf/01_easter1
source: Don't beat Nigel at pool. You've veen warned. :)
cs: Neporážejte Nigela v kulečníku. Byli jste varováni. :)

# secretf/01_easter1
source: Eating too many chocolate eggs can make you sick :p
cs: Když sníte příliš mnoho čokoládových vajíček, může vám být špatně :p

# secretf/02_easter2
source: Sloping Tunnel Entrance
cs: Šikmý vjezd do tunelu

# secretf/02_easter2
source: To access the tunnels above find the access warp.
cs: Chcete-li se dostat do horních tunelů, najděte přístupový teleport.

# secretf/02_easter2
source: One route leads to riches. One route leads to battle.
cs: Jedna cesta vede k bohatství. Druhá cesta vede do boje.

# secretf/03_easter3
source: Only those who can double-jump can get to the goodies!
cs: K dobrotám se dostane jen ten, kdo zvládne dvojitý skok!

# secretf/03_easter3
source: Find the crate to make your climbing blocks appear
cs: Najděte bednu, aby se objevily lezecké bloky

# secretf/03_easter3
source: Stomping this crate also free's some enemies :)
cs: Rozšlápnutím této bedny také osvobodíte nějaké nepřátele :)

# secretf/04_haunted1
source: Enter the house with caution.....
cs: Dbejte zvýšené opatrnosti.....

# secretf/04_haunted1
source: Silver Crates can't be broken underwater...
cs: Stříbrné bedny nelze rozbít pod vodou...

# secretf/04_haunted1
source: Water Level control crate above.
cs: Bedna pro regulaci hladiny vody umístěná výše.

# secretf/04_haunted1
source: Stomping crates can be good and bad...
cs: Rozbíjení beden může být dobré i špatné...

# secretf/04_haunted1
source: But you need a way to get up there...
cs: Ale potřebuješ se tam nějak dostat...

# secretf/06_haunted3
source: Michelle, I will love you always and forever :)
cs: Michelle, Budu tě milovat vždy a navždy :)

# secretf/07_town1
source: Take to the roof tops!
cs: Vydejte se na střechy!

# secretf/07_town1
source: The skies above will reward those who stomp...
cs: Nebe nad vámi odmění ty, kteří si dupnou...

# secretf/07_town1
source: Jump as far over to the right as you possibly can...
cs: Skočte co nejdále k doprava, jak jen to půjde...

# secretf/07_town1
source: Didn't make the jump huh? :)
cs: Nezvládli jste skočit, co? :)

# secretf/07_town1
source: Well Done!
cs: Dobrá práce!

# secretf/07_town1
source: Use your Special Moves to get up the air cons! For Jazz, press Crouch and Jump. For Spaz, Press Jump Twice!
cs: Použijte své speciální pohyby, abyste se dostali do klimatizace! S Jazzem stiskněte dolů a skok. Se Spazem stiskněte dvakrát skok!

# secretf/08_town2
source: Find the crate and the gems are yours!
cs: Najděte bednu a drahokamy jsou vaše!

# secretf/08_town2
source: Springs Don't Work When Frozen...
cs: Pružiny při zamrznutí nefungují...

# secretf/08_town2
source: Collecting 20 coins is more rewarding...
cs: Sebrání 20 mincí se vyplatí...

# secretf/09_town3
source: Find the crate to clear the blocks....
cs: Najděte bednu pro uvolnění cesty....

# secretf/09_town3
source: BEWARE! Flocks of Ravens can be very dangerous.
cs: POZOR! Hejna krkavců mohou být velmi nebezpečná.

# secretf/09_town3
source: The remove the blocks look to the tallest building.
cs: Chcete-li bloky odstranit, podívejte se na nejvyšší budovu.

# secretf/09_town3
source: Choose a cover and stomp away!
cs: Vyberte si kryt a vyrazte!

# secretf/09_town3
source: Hi GeoBunny :)
cs: Ahoj, GeoBunny :)

# secretf/09_town3
source: Goto www.project2.com use password: BUNNYLOVER
cs: Prosím navštivte www.project2.com a zadejte heslo: BUNNYLOVER

# share/01_share1
source: Shoot these blocks!
cs: Střelte do těchto bloků!

# share/01_share1
source: When in the air, press down to stomp with your butt.
cs: Když jste ve vzduchu, stiskněte tlačítko dolů pro proražení bloků směrem dolu.

# share/01_share1
source: To pass this area, stomp the secret metal crate.
cs: Chcete-li projít touto oblastí, rozšlápněte tajnou kovovou bednu.

# share/01_share1
source: You need twenty coins to pass through this secret warp!
cs: Pro průchod touto tajnou bránou potřebujete dvacet mincí!

# share/01_share1
source: Coins give you access to warps that appear later.
cs: Mince umožní přístup k teleportům, které se objeví později.

# share/01_share1
source: Stomp in the right place and you might find a surprise!
cs: Dupněte na správné místo a možná vás čeká překvapení!

# share/01_share1
source: Some crates contain bombs or baddies!
cs: Některé bedny obsahují bomby nebo záškodníky!

# share/02_share2
source: You need twenty coins to pass through this secret warp!
cs: Pro průchod touto tajnou bránou potřebujete dvacet mincí!

# share/02_share2
source: A flamethrower works well against nasty bugs.
cs: Proti nepříjemnému hmyzu dobře funguje plamenomet.

# share/02_share2
source: Smoke rings will make you very dizzy!
cs: Z kouřových mraků se vám bude točit hlava!

# share/03_share3
source: Beware the witch! She can turn you into a frog.
cs: Pozor na čarodějnici! Může vás proměnit v žábu.

# share/03_share3
source: If you are turned into a frog Eva Earlong can help!
cs: Pokud jste se proměnili v žábu, Eva Earlong vám pomůže!

# share/03_share3
source: You made it! This is the end of the shareware version. Now check out the order info for M O R E!
cs: Zvládli jste to! Toto je konec sharewarové verze. Podívejte na informace o plné verzi!

# xmas99/01_xmas1
source: Watch out for the spikes below!
cs: Pozor na hroty dole!

# xmas99/01_xmas1
source: You can buttstomp through some of the weakspots in the pathways!
cs: Některá slabá místa na cestách můžete prošlápnout!

# xmas99/01_xmas1
source: Some blocks can only be broken with a certain weapon.
cs: Některé bloky lze rozbít pouze určitou zbraní.

# xmas99/01_xmas1
source: Welcome to Christmas Chronicles!
cs: Vítejte ve vánočních letopisech!

# xmas99/01_xmas1
source: Seasons Greetings from Epic MegaGames Orange Games and Project 2 Interactive!
cs: Zdraví vás Epic MegaGames, Orange Games a Project 2 Interactive!

# xmas99/02_xmas2
source: You can stand on top of some of the trees!
cs: Na některých stromech můžete i stát!

# xmas99/02_xmas2
source: You can buttstomp through some of the weakspots in the pathways!
cs: Některá slabá místa na cestách můžete prošlápnout!

# xmas99/02_xmas2
source: Punching the blocks above you can be rewarding.
cs: Údery do bloků nad vámi mohou být přínosné.

# xmas99/02_xmas2
source: Gem Trail Entry Crate.
cs: Vstupní bedna stezky drahokamů.

# xmas99/02_xmas2
source: Gem Trail Entrance. Climb the treetops to find and stomp the Entry Crate.
cs: Vstup na stezku drahokamů. Vyšplhej do korun stromů, najdi a rozdupej vstupní bednu.

# xmas99/02_xmas2
source: Hi There, Piggy! - Poopy
cs: Ahoj, prasátko! - Hovínko

# xmas99/02_xmas2
source: Michelle: You've changed my life in so many ways I dedicate this project to you. I love you so much.
cs: Michelle: Změnil jsi můj život v mnoha ohledech. Tento projekt ti věnuji. Mám tě moc ráda.

# xmas99/02_xmas2
source: Kassi Nicole: A million things I long to say to you But my words always lead to the same ending I love you, I love you.
cs: Kassi Nicole: Milion věcí, které ti toužím říct Ale má slova vždy vedou ke stejnému konci. Miluji tě, miluji tě.

# xmas99/03_xmas3
source: Please use your TNT wisely.
cs: Používejte prosím TNT moudře.

# xmas99/03_xmas3
source: Don't lose your grip!
cs: Neztrácejte kontrolu!

# xmas99/03_xmas3
source: Welcome to Burrowsville Please drive carefully.
cs: Vítejte v Burrowsville Jezděte prosím opatrně.

# xmas99/03_xmas3
source: That bridge doesnt look too safe...
cs: Ten most nevypadá příliš bezpečně...

# xmas99/03_xmas3
source: Robert and Craig: Springs RULE! :)
cs: Robert a Craig: Pružiny kralují! :)

# xmas99/03_xmas3
source: Now leaving Burrowsville Please visit again.
cs: Nyní opouštíte Burrowsville Děkujeme za návštěvu.

# xmas99/03_xmas3
source: Password: xmasbunny Please visit www.project2.com
cs: Heslo: xmasbunny Prosím navštivte www.project2.com

source: Reimplementation of the game f[c:0x9e7056]Jazz Jackrabbit 2f[c] released in 1998. Supports various versions of the game (Shareware Demo, Holiday Hare '98, The Secret Files and Christmas Chronicles). Also, it partially supports some features of JJ2+ extension. For more information, visit the official website: %s
cs: Jazz² Resurrection je reimplementace hry f[c:0x9e7056]Jazz Jackrabbit 2f[c] z roku 1998. Umožňuje hrát úrovně z různých verzí původní hry (Shareware Demo, Holiday Hare '98, The Secret Files a Christmas Chronicles). Dále také obsahuje některé nové funkce. Pro více informací můžete navštívit oficiální webové stránky: %s

source: Created By
cs: Vytvořil

source: This project uses modified f[c:0x9e7056]nCinef[c] game engine and following libraries: %s
cs: Tento projekt využívá upravený herní engine f[c:0x9e7056]nCinef[c] a tyto knihovny: %s

source: Import Episodes
cs: Importovat epizody

source: Play Story
cs: Hrát příběh

source: Play Custom Levels
cs: Hrát vlastní úrovně

source: Options
cs: Nastavení

source: About
cs: O aplikaci

source: Quit
cs: Ukončit

source: Play Shareware Demo
cs: Hrát Shareware Demo

source: Access to external storage has been granted!
cs: Přístup k externímu úložišti byl povolen!

source: f[c:0x337233]Restart the game to read f[c:0x9e7056]Jazz Jackrabbit 2f[c:0x337233] files correctly.
cs: f[c:0x337233]Restartujte hru, aby bylo možné správně přečíst soubory f[c:0x9e7056]Jazz Jackrabbit 2f[c:0x337233].

source: f[c:0x704a4a]This game requires original f[c:0x9e7056]Jazz Jackrabbit 2f[c:0x704a4a] files!
cs: f[c:0x704a4a]Tato hra vyžaduje originální soubory f[c:0x9e7056]Jazz Jackrabbit 2f[c:0x704a4a]!

source: Make sure Jazz Jackrabbit 2 files are present in following path:
cs: Ujistěte se, že soubory Jazz Jackrabbit 2 jsou přístupné v tomto umístění:

source: Allow access to external storage
cs: Povolit přístup k externímu uložišti

source: Remap Controls
cs: Přenastavit ovládání

source: Touch Controls
cs: Dotykové ovládací prvky

source: Input Diagnostics
cs: Diagnostika ovládání

source: Native Back Button
cs: Nativní tlačítko Zpět

source: Controls
cs: Ovládání

source: Enabled
cs: Povoleno

source: Disabled
cs: Zakázáno

source: No custom level found!
cs: Nebyly nalezeny žádné vlastní úrovně!

source: No episode found!
cs: Nebyly nalezeny žádné epizody!

source: Restart episode
cs: Smazat postup

source: You must complete "%s" first!
cs: Nejprve musíte dokončit "%s"!

source: Episode is locked!
cs: Epizoda je zamčena!

source: Ledge Climbing
cs: Povolit šplhání

source: Weapon Wheel
cs: Kolečko zbraní

source: Enhancements
cs: Vylepšení

source: You can enable enhancements that were added to this remake.
cs: Zde můžete zapnout jednotlivá vylepšení přidaná do hry.

source: Enabled With Ammo Count
cs: Povoleno s počtem munice

source: Language
cs: Jazyk

source: Discord Integration
cs: Integrace Discordu

source: Scripting
cs: Skripty

source: Browse "Source" Directory
cs: Otevřít složku "Source"

source: Refresh Cache
cs: Obnovit cache

source: Gameplay
cs: Hra

source: Rescale Mode
cs: Režim škálování

source: Fullscreen
cs: Celá obrazovka

source: Graphics Quality
cs: Kvalita grafiky

source: Show Player Trails
cs: Zobrazit stopy hráčů

source: Keep Aspect Ratio In Cinematics
cs: Zachovat poměr stran u filmů

source: Performance Metrics
cs: Metrika výkonu

source: Graphics
cs: Grafika

source: Low
cs: Nízká

source: High
cs: Vysoká

source: Select files of your original game to unlock additional episodes
cs: Vyberte soubory vaší původní hry pro odemknutí dalších epizod

source: Processing of selected files...
cs: Zpracování vybraných souborů...

source: Waiting for files...
cs: Čekání na soubory...

source: No files were selected!
cs: Nebyly vybrány žádné soubory!

source: No new episodes were imported!
cs: Nebyly importovány žádné nové epizody!

source: No gamepads are detected!
cs: Nebyly detekovány žádné gamepady!

source: Sounds
cs: Zvuky

source: Resume
cs: Pokračovat

source: Save & Exit
cs: Uložit & Ukončit

source: Processing of files in f[c:0x9e7056]"Source"f[c] directory...
cs: Zpracování souborů ve složce f[c:0x9e7056]"Source"f[c]...

source: Newly added levels and episodes will be available soon.
cs: Nově přidané úrovně a epizody budou brzy k dispozici.

source: Key %i
cs: Klávesa %i

source: Up
cs: Nahoru

source: Down
cs: Dolů

source: Left
cs: Doleva

source: Right
cs: Doprava

source: Fire
cs: Střelba

source: Jump
cs: Skok

source: Run
cs: Běh

source: Change Weapon
cs: Změnit zbraň

source: Back
cs: Zpět

source: None / Pixel-perfect
cs: Žádný / Pixel-perfect

source: Select Rescale Mode
cs: Vybrat režim škálování

source: Error
cs: Chyba

source: f[c:0x704a4a]Cannot load specified level!f[c] Make sure all necessary files are accessible and try it again.
cs: f[c:0x704a4a]Nelze načíst zadanou úroveň!f[c] Ujistěte se, že všechny potřebné soubory jsou přístupné, a zkuste to znovu.

source: Master Volume
cs: Hlavní hlasitost

source: SFX Volume
cs: Hlasitost zvukových efektů

source: Music Volume
cs: Hlasitost hudby

source: Character
cs: Postava

source: Difficulty
cs: Obtížnost

source: Start
cs: Spustit hru

source: Easy
cs: Lehká

source: Medium
cs: Střední

source: Hard
cs: Těžká

source: You can adjust position of the touch zones by drag and drop.
cs: Pozice zón dotyku můžete upravit přetažením.
